//=============================================================================
//
// モーション処理 [motion.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _MOTION_H_
#define _MOTION_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "model.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMotion
{
public:
	CMotion();	// デフォルトコンストラクタ
	~CMotion();	// デフォルトデストラクタ
	static bool PlayMotin(CModel::MOTIONINFO *motion, D3DXVECTOR3 *pos, D3DXVECTOR3 *rot);	// モーションのプレイ
private:
};

#endif
