//=============================================================================
//
// 入力処理 [input.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _RULE_H_
#define _RULE_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CUiObj;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CRule
{
public:
	CRule();	// デフォルトコンストラクタ
	~CRule();	// デフォルトデストラクタ
	HRESULT Init(void);	// 初期化
	void Uninit(void);		// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画
	tuple<int, string, float> Get(void);
private:
	void SelectInfo(void);	// 選択処理
	vector<string> m_Type;	// テクスチャタイプ
	vector<CUiObj*> m_Ui;	// UI
	int m_nUiNum;	// UI数
};

#endif