//=============================================================================
//
// 文字ポリゴンの処理 [textureobj.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _COLLISION_H_
#define _COLLISION_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MIN_EXTENSION (0.8f)
#define MAX_EXTENSION (1.3f)

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CNotes;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CCollision : public CScene2D
{
public:
	CCollision();	// デフォルトコンストラクタ
	~CCollision();	// デフォルトデストラクタ
	HRESULT Init(void);	// ポリゴンの初期化
	void Uninit(void);	// ポリゴンの終了
	void Update(void);	// ポリゴンの更新
	void Draw(void);	// ポリゴンの描画
	static CCollision *Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, string Type, CNotes *pNotes);	// 生成(位置、サイズ、テクスチャ)
private:
	CNotes *m_pNoets;	// ノーツ
	D3DXVECTOR3 m_Pos;	// 位置
	D3DXVECTOR2 m_Size;	// サイズ
	string m_TexType;	// テクスチャ
};

#endif