//=============================================================================
//
// 文字ポリゴンの処理 [textureobj.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _NOTES_H_
#define _NOTES_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "scene2D.h"

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CCollision;
class CEnemy;

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CNotes : public CScene2D
{
public:
	CNotes();	// デフォルトコンストラクタ
	~CNotes();	// デフォルトデストラクタ
	HRESULT Init(void);	// ポリゴンの初期化
	void Uninit(void);	// ポリゴンの終了
	void Update(void);	// ポリゴンの更新
	void Draw(void);	// ポリゴンの描画
	CEnemy *GetEnemy(void) { return m_pEnemy; }	// ゲッダー
	static CNotes *Create(D3DXVECTOR3 pos, D3DXVECTOR2 size, string Type);	// 生成(位置、サイズ、テクスチャ)
private:
	CCollision *m_pCollision;	// 判定
	CEnemy *m_pEnemy;	// 敵
	D3DXVECTOR3 m_Pos;	// 位置
	D3DXVECTOR2 m_Size;	// サイズ
	string m_TexType;	// テクスチャ
};

#endif