//=============================================================================
//
// 入力処理 [input.h]
// Author : 羽鳥太一
//
//=============================================================================
#ifndef _MATCHING_H_
#define _MATCHING_H_

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"

//*****************************************************************************
// クラス定義
//*****************************************************************************
class CMatching
{
public:
	CMatching();	// デフォルトコンストラクタ
	~CMatching();	// デフォルトデストラクタ
	HRESULT Init(void);	// 初期化
	void Uninit(void);		// 終了
	void Update(void);	// 更新
	void Draw(void);	// 描画
	static void ConnectTh(void);	// マッチ中のポリゴン
private:
	static bool m_bConnect;	// つながったか
	static bool m_bEnemyConnect;	// 相手の回線
};

#endif